Project/Toir/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ИдентификаторыТехКарт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Обслуживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехКарты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремениТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданаАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ШаблонОригинал</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаОкончанияАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаЛев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаПрав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество работников данной квалификации необходимое для выполнения тех.операции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмеряемыеПоказатели</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ТребуемыйРезультатИзмерения</name>
      <comment>TOIR20-503</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МерыБезопасности</name>
    <attributes>
      <name>МераБезопасности</name>
      <type>
        <types>CatalogRef.торо_МерыБезопасности</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ИспытанияОборудования</name>
    <comment>TOIR20-503</comment>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспытаниеОборудования</name>
      <type>
        <types>CatalogRef.гкс_ИспытанияОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ИдентификаторыТехКарт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.торо_ИдентификаторыТехКарт");
	Если ФорматнаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Поля.Добавить("Ссылка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.торо_ИдентификаторыТехКарт");
	Если ФорматнаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	СписокПолей = торо_РаботаСПользовательскимПредставлением.ПолучитьСписокПолей(ФорматнаяСтрока);
	Если СписокПолей.Количество() > 0 Тогда
		ТекстЗапроса = "ВЫБРАТЬ ";
		Для Каждого ЭлСписка Из СписокПолей Цикл
			ТекстЗапроса = ТекстЗапроса + "торо_ТехКарты."+ЭлСписка+",";
		КонецЦикла;
		ТекстЗапроса = Лев(ТекстЗапроса,СтрДлина(ТекстЗапроса)-1);
		ТекстЗапроса = ТекстЗапроса + " ИЗ
		               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(, ИдентификаторТехКарты = &ID_ТК) КАК торо_ВерсииТехКартСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты КАК торо_ТехКарты
		               |		ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты.Ссылка";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ID_ТК",Данные.Ссылка);
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураДанных = Новый Структура;
			Для Каждого ЭлСписка Из СписокПолей Цикл
				СтруктураДанных.Вставить(ЭлСписка,Выборка[ЭлСписка]);
			КонецЦикла;
			Представление = торо_РаботаСПользовательскимПредставлением.ПолучитьПредставлениеПоФорматнойСтроке(ФорматнаяСтрока,СтруктураДанных);
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	торо_ИдентификаторыТехКарт.Наименование КАК Наименование
			               |ИЗ
			               |	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
			               |ГДЕ
			               |	торо_ИдентификаторыТехКарт.Ссылка = &ID_ТК";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Представление = Выборка.Наименование;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Представление = ФорматнаяСтрока;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Технологическая карта
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.торо_ИдентификаторыТехКарт";
	КомандаПечати.Идентификатор = "ТехКарта";
	КомандаПечати.Представление = НСтр("es='La tarjeta tecnológica';ru='Технологическая карта';en='Technological map'");
	КомандаПечати.Обработчик = "торо_Печать.ПечататьТекущуюВерсиюТехКары";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехКарта") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
															"ТехКарта", 
															"Технологическая карта", 
															ПечатьТехКарты(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Функция - заполняет список реквизитов, которые можно использовать при формировании форматной строки в конструкторе.
//
// Параметры:
//  СписокРеквизитов - СписокЗначений - пустой список значений для заполнения.
Процедура ЗаполнитьСписокРеквизитовДляФорматнойСтроки(СписокРеквизитов) Экспорт
	
	СписокРеквизитов.Добавить("Наименование",		"Наименование");
	СписокРеквизитов.Добавить("Код",				"Код");
	СписокРеквизитов.Добавить("ДатаПринятия",		"Дата принятия");
	СписокРеквизитов.Добавить("НормаВремениТекст",	"Норма времени");
	СписокРеквизитов.Добавить("ВремяПростояТекст",	"Время простоя");
	СписокРеквизитов.Добавить("Комментарий",		"Комментарий");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьТехКарты(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.торо_ИдентификаторыТехКарт.ПФ_MXL_ТехКарта"); 
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	ЭтоПервый = Истина;
		
	Для каждого Объект из МассивОбъектов Цикл
		
		Если ПараметрыПечати.Свойство("ДатаПринятия") Тогда
			ДатаПринятия =  ПараметрыПечати.ДатаПринятия;
		Иначе 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	торо_ВерсииТехКартСрезПоследних.ТехКарта.ДатаПринятия КАК ДатаПринятия
			               |ИЗ
			               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(, ИдентификаторТехКарты = &Ссылка) КАК торо_ВерсииТехКартСрезПоследних";
			
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаПринятия = Результат.Выгрузить()[0].ДатаПринятия;
		КонецЕсли;
	
		ТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(Объект, ДатаПринятия);
		
		Если НЕ ЗначениеЗаполнено(ТехКарта)Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоПервый Тогда
			ТабДок.Вывести(ОбластьОтступ);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ОбластьНаименования = Макет.ПолучитьОбласть("Название");
		ОбластьНаименования.Параметры.Наименование = Строка(Объект);
		ТабДок.Вывести(ОбластьНаименования);
		
		ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапки.Параметры.Наименование = Строка(Объект);
		ОбластьШапки.Параметры.ПродолжительностьТехКарты = ПреобразоватьВремя(ТехКарта.НормаВремени);
		ОбластьШапки.Параметры.ДатаНачала = Формат(ТехКарта.ДатаПринятия, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьШапки);
		
		ОблКомментарийТК = Макет.ПолучитьОбласть("КомментарийТК");
		ОблКомментарийТК.Параметры.КомментарийТК = ТехКарта.Комментарий; 
		ТабДок.Вывести(ОблКомментарийТК);	
				
		ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДок.Вывести(ШапкаТаблицы);
		
		ТЗ = Новый ТаблицаЗначений;
		Дерево = Новый ДеревоЗначений;
		Индекс = 0;
		ЗаполнитьТЗ(Объект,ТЗ, Индекс, ,ТехКарта.ДатаПринятия);
		ИндексДерева = 0;
		ЗаполнитьДерево(Объект, Дерево, ИндексДерева, ,ТехКарта.ДатаПринятия);
				
		НовыйТЗ = Новый ТаблицаЗначений;
		НовыйТЗ = ТЗ.Скопировать();
		
		Если ТЗ.Количество() <> 0 Тогда
			НовыйТЗ.Свернуть( "Родитель1, Операция, СпособВыполнения, Кратность" );
		КонецЕсли;
		
		ИтоговаяТз = НОвый ТаблицаЗначений;
		ИтоговаяТз.Колонки.Добавить( "Родитель1" );
		ИтоговаяТз.Колонки.Добавить( "ТехнологическаяОперация" );
		ИтоговаяТз.Колонки.Добавить( "Продолжительность" );
		ИтоговаяТз.Колонки.Добавить( "СпособВыполнения" );
		ИтоговаяТз.Колонки.Добавить( "МатериальныеЗатратыИКоличество" );
		ИтоговаяТз.Колонки.Добавить( "ТрудозатратыКоличествоВремяРаботы" );
		ИтоговаяТз.Колонки.Добавить( "ИнстурментыИТехника" );
		ИтоговаяТз.Колонки.Добавить( "Показатель" );
		ИтоговаяТз.Колонки.Добавить( "ПолноеНаименование" );
		ИтоговаяТз.Колонки.Добавить( "Кратность" );
		ИтоговаяТз.Колонки.Добавить( "Комментарий" );
		
		Для Каждого СтрокаНовыйТЗ Из НовыйТЗ Цикл
			
			МассивСтрок = ТЗ.НайтиСтроки(Новый Структура( "Родитель1, Операция",СтрокаНовыйТЗ.Родитель1, СтрокаНовыйТЗ.Операция ));
			НоваяСтрокаИтоговойТаблицы = ИтоговаяТз.Добавить();
			
			НоваяСтрокаИтоговойТаблицы.Родитель1               = СтрокаНовыйТЗ.Родитель1; 
			НоваяСтрокаИтоговойТаблицы.ТехнологическаяОперация = СтрокаНовыйТЗ.Операция;
			НоваяСтрокаИтоговойТаблицы.СпособВыполнения 	   = СтрокаНовыйТЗ.СпособВыполнения;
			НоваяСтрокаИтоговойТаблицы.Кратность		       = СтрокаНовыйТЗ.Кратность;
						
			Если ТипЗнч(СтрокаНовыйТЗ.Операция) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				НоваяСтрокаИтоговойТаблицы.ПолноеНаименование		   = СтрокаНовыйТЗ.Операция.СодержаниеРабот;
			КонецЕсли;
			
			ВремяЧасов = Цел(МассивСтрок[0].Продолжительность/60/60);
			ВремяМинут = Цел(Число(МассивСтрок[0].Продолжительность - 3600 * ВремяЧасов) / 60);
			
			НоваяСтрокаИтоговойТаблицы.Продолжительность       = Строка(ВремяЧасов) + " ч. " + Строка(ВремяМинут) + " мин. ";
			
			Материалы         = "";
			Трудозатраты      = "";
			Инструмент        = "";
			Показатель        = "";
			МерыБезопасности  = "";
			Комментарий       = "";
			
			ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
						
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				
				Если ЗначениеЗаполнено(СтрокаМассива.Номенклатура) Тогда
					МатериалыХарактеристика =  "";
					ПереносСПервойСтроки = ?(Материалы = "","", Символы.ПС);
					Если ИспользоватьХарактеристики Тогда
						МатериалыХарактеристика = ?(ЗначениеЗаполнено(СтрокаМассива.Характеристика), ", " + СтрокаМассива.Характеристика, 
				                          ?(ЗначениеЗаполнено(СтрокаМассива.НаименованиеХарактеристики), ", " + СтрокаМассива.НаименованиеХарактеристики,""));				  
					КонецЕсли;
					Материалы = Материалы + ПереносСПервойСтроки + Строка(СтрокаМассива.Номенклатура) + МатериалыХарактеристика + ", " + Строка(СтрокаМассива.Количество) + " " + Строка(СтрокаМассива.ЕдиницаИзмерения) + ".";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Квалификация) Тогда
					ПереносСПервойСтроки = ?(Трудозатраты = "","", Символы.ПС);
					Трудозатраты = Трудозатраты + ПереносСПервойСтроки + Строка(СтрокаМассива.Квалификация) + ", " + Строка(СтрокаМассива.КолКвалификаций) + ", " + ПреобразоватьВремя(СтрокаМассива.ВремяРаботы);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Инструмент) Тогда
					ПереносСПервойСтроки = ?(Инструмент = "","", Символы.ПС);
					Инструмент = Инструмент + ПереносСПервойСтроки + Строка(СтрокаМассива.Инструмент) + ", " + Строка(СтрокаМассива.КолИнстр) + " " + Строка(СтрокаМассива.ЕдИзмИнстр);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Показатель) Тогда
					ПереносСПервойСтроки = ?(Показатель = "","", Символы.ПС);
					Показатель = Показатель + ПереносСПервойСтроки + Строка(СтрокаМассива.Показатель);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаМассива.Комментарий) Тогда 
				    Комментарий = СтрокаМассива.Комментарий;
				КонецЕсли;
				
			КонецЦикла;
			
			НоваяСтрокаИтоговойТаблицы.МатериальныеЗатратыИКоличество = Материалы;
			НоваяСтрокаИтоговойТаблицы.ТрудозатратыКоличествоВремяРаботы = Трудозатраты;
			НоваяСтрокаИтоговойТаблицы.ИнстурментыИТехника = Инструмент;
			НоваяСтрокаИтоговойТаблицы.Показатель = Показатель;
			НоваяСтрокаИтоговойТаблицы.Комментарий = Комментарий;
		КонецЦикла;
		
		МассивУровней = Новый Массив;
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		Для Каждого Строка Из  ИтоговаяТз Цикл
			
			МассивСтрокДерева = Дерево.Строки.НайтиСтроки(Новый Структура("Родитель1, Операция", Строка.Родитель1, СТрока.ТехнологическаяОперация),Истина);
			Уровень = МассивСтрокДерева[ 0 ].Уровень();
			
			КолЭлем = МассивУровней.ВГраница();
			Если КолЭлем >= Уровень Тогда
				Номер = МассивУровней.Получить(Уровень);
				МассивУровней.Удалить(Уровень);
				МассивУровней.Вставить(Уровень, Номер + 1);
			Иначе
				МассивУровней.Вставить(Уровень,1);
			КонецЕсли;
			СтрокаОперации = Макет.ПолучитьОбласть( "СтрокаТаблицы" );
			СтрокаОперации.Параметры.Заполнить( Строка );
			СтрокаОперации.Параметры.НомерТО = МассивУровней.Получить(Уровень);
			Если ТипЗнч(Строка.ТехнологическаяОперация) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") И Не Строка.ТехнологическаяОперация.НаименованиеДляПечати = "" Тогда
			    СтрокаОперации.Параметры.ТехнологическаяОперация = Строка.ТехнологическаяОперация.НаименованиеДляПечати;
			Иначе
			    СтрокаОперации.Параметры.ТехнологическаяОперация = Строка.ТехнологическаяОперация.Наименование;
			КонецЕсли;
			
			НоваяСтрока = ТабДок.Вывести( СтрокаОперации, Уровень );
			ТабДок.Область(НоваяСтрока.Верх,1).Отступ = Уровень * 2;
			ТабДок.Область(НоваяСтрока.Верх,2).Отступ = Уровень * 2;
			Если ТипЗнч(Строка.ТехнологическаяОперация) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				ТабДок.Область("СтрокаТаблицы").ЦветФона = Новый Цвет(156,156,156);
			КонецЕсли;
			
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ЗаполнитьДерево(ТехКарта, Дерево,ИндексДерева, СтрокаРодитель = Неопределено, Дата = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ТехКарта КАК Родитель1,
	               |	торо_ТехКарты_СписокОпераций.Продолжительность,
	               |	торо_ТехКарты_СписокОпераций.ID,
	               |	торо_ТехКарты_СписокОпераций.Операция
	               |ИЗ
	               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаСреза, ИдентификаторТехКарты = &ТехКарта) КАК торо_ВерсииТехКартСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКарты_СписокОпераций
	               |		ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты_СписокОпераций.Ссылка";

	Запрос.УстановитьПараметр("ТехКарта",ТехКарта);
	Запрос.УстановитьПараметр("ДатаСреза", Дата);

	Результат = Запрос.Выполнить();
	Таблица = Запрос.Выполнить().Выгрузить();

	Для каждого Строка Из Таблица Цикл
		
		Если ИндексДерева =0 Тогда
			
			ДобавитьКолонкиВДерево(Дерево,Строка,ИндексДерева);
			
		КонецЕсли;
		
		Если ТипЗнч(Строка.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			Если СтрокаРодитель = Неопределено Тогда
				НС = Дерево.Строки.Добавить();
			Иначе
				НС = СтрокаРодитель.Строки.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НС, Строка);
			ЗаполнитьДерево(Строка.Операция, Дерево,ИндексДерева, НС, Дата);
		Иначе
			Если СтрокаРодитель = Неопределено Тогда
				НС = Дерево.Строки.Добавить();
			Иначе
				НС = СтрокаРодитель.Строки.Добавить();
			КонецЕсли;
				ЗаполнитьЗначенияСвойств(НС, Строка);
				
		КонецЕсли;
	
	КонецЦикла;

	
КонецПроцедуры

Процедура ЗаполнитьТЗ (ТехКарта, ТЗ, Индекс, СтрокаРодитель = Неопределено, Дата = Неопределено) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТехКарты_СписокОпераций.НормаВремениВСекундах КАК Продолжительность,
	               |	торо_ТехКарты_СписокОпераций.ID КАК ID,
	               |	торо_ТехКарты_СписокОпераций.Операция КАК Операция,
	               |	торо_ТехКарты_СписокОпераций.Ссылка КАК Ссылка,
	               |	торо_ТехКарты_СписокОпераций.СпособВыполнения КАК СпособВыполнения,
	               |	торо_ТехКарты_СписокОпераций.Количество КАК Кратность,
	               |	ВЫРАЗИТЬ(торо_ТехКарты_СписокОпераций.Операция КАК Справочник.торо_ТехнологическиеОперации).Комментарий КАК Комментарий
	               |ПОМЕСТИТЬ СписокОпераций
	               |ИЗ
	               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&Дата, ИдентификаторТехКарты = &ТехКарта) КАК торо_ВерсииТехКартСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКарты_СписокОпераций
	               |		ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты_СписокОпераций.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_РемонтыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА торо_РемонтыМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения
	               |	КОНЕЦ КАК ЕдиницаИзмерения,
	               |	торо_РемонтыМатериальныеЗатраты.Количество КАК Количество,
	               |	торо_РемонтыМатериальныеЗатраты.Характеристика.НаименованиеПолное КАК Характеристика,
	               |	торо_РемонтыМатериальныеЗатраты.Характеристика.Наименование КАК НаименованиеХарактеристики,
	               |	торо_РемонтыМатериальныеЗатраты.ID КАК ID,
	               |	NULL КАК Квалификация,
	               |	NULL КАК ВремяРаботы,
	               |	NULL КАК КолКвалификаций,
	               |	NULL КАК Инструмент,
	               |	NULL КАК КолИнстр,
	               |	NULL КАК ЕдИзмИнстр,
	               |	NULL КАК Показатель
	               |ПОМЕСТИТЬ СписокМатериалов
	               |ИЗ
	               |	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыМатериальныеЗатраты.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыМатериальныеЗатраты.ID = СписокОпераций.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыТрудовыеЗатраты.ID,
	               |	торо_РемонтыТрудовыеЗатраты.Квалификация,
	               |	торо_РемонтыТрудовыеЗатраты.ВремяРаботы,
	               |	торо_РемонтыТрудовыеЗатраты.Количество,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_РемонтыТрудовыеЗатраты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыТрудовыеЗатраты.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыТрудовыеЗатраты.ID = СписокОпераций.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИнструментыИТехника.ID,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИнструментыИТехника.Инструмент,
	               |	торо_РемонтыИнструментыИТехника.Количество,
	               |	ВЫБОР
	               |		КОГДА торо_РемонтыИнструментыИТехника.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА торо_РемонтыИнструментыИТехника.Инструмент.ЕдиницаИзмерения
	               |		ИНАЧЕ торо_РемонтыИнструментыИТехника.ЕдиницаИзмерения
	               |	КОНЕЦ,
	               |	NULL
	               |ИЗ
	               |	Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_РемонтыИнструментыИТехника
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыИнструментыИТехника.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыИнструментыИТехника.ID = СписокОпераций.ID
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИзмеряемыеПоказатели.ID,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	торо_РемонтыИзмеряемыеПоказатели.Показатель
	               |ИЗ
	               |	Справочник.торо_ТехКарты.ИзмеряемыеПоказатели КАК торо_РемонтыИзмеряемыеПоказатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыИзмеряемыеПоказатели.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыИзмеряемыеПоказатели.ID = СписокОпераций.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТехКарта КАК Родитель1,
	               |	СписокОпераций.Операция КАК Операция,
	               |	СписокОпераций.Продолжительность КАК Продолжительность,
	               |	СписокМатериалов.Номенклатура КАК Номенклатура,
	               |	СписокМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЕСТЬNULL(СписокМатериалов.Количество, 0) КАК Количество,
	               |	СписокМатериалов.Характеристика КАК Характеристика,
	               |	СписокМатериалов.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	               |	СписокМатериалов.Квалификация КАК Квалификация,
	               |	СписокМатериалов.ВремяРаботы КАК ВремяРаботы,
	               |	СписокМатериалов.КолКвалификаций КАК КолКвалификаций,
	               |	СписокМатериалов.Инструмент КАК Инструмент,
	               |	СписокМатериалов.КолИнстр КАК КолИнстр,
	               |	СписокМатериалов.Показатель КАК Показатель,
	               |	СписокМатериалов.ЕдИзмИнстр КАК ЕдИзмИнстр,
	               |	СписокОпераций.СпособВыполнения КАК СпособВыполнения,
	               |	СписокОпераций.Комментарий КАК Комментарий,
	               |	СписокОпераций.Кратность КАК Кратность
	               |ИЗ
	               |	СписокОпераций КАК СписокОпераций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СписокМатериалов КАК СписокМатериалов
	               |		ПО (СписокМатериалов.ID = СписокОпераций.ID)";
				  
	Запрос.УстановитьПараметр("ТехКарта",ТехКарта);

	Запрос.УстановитьПараметр("Дата", Дата);
	
	
	Результат = Запрос.Выполнить();
	Таблица = Запрос.Выполнить().Выгрузить();

	Для каждого Строка Из Таблица Цикл
		
		Если ТипЗнч(Строка.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			Если Индекс =0 Тогда
				ДобавитьКолонкиВТЗ(ТЗ,Строка, Индекс);
			КонецЕсли;
			НС = ТЗ.Добавить();
			НС.Родитель1 = СтрокаРодитель;
			ЗаполнитьЗначенияСвойств(НС, Строка);	
			ТехнолКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(Строка.Операция);
			НС.Комментарий = ТехнолКарта.Комментарий;
			ЗаполнитьТЗ(Строка.Операция, ТЗ, Индекс, СтрокаРодитель, ТехнолКарта.ДатаПринятия);
			
		Иначе	
			Если Индекс =0 Тогда
				ДобавитьКолонкиВТЗ(ТЗ,Строка, Индекс);
            КонецЕсли;
			
			НС = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьКолонкиВДерево(Дерево,Строка,ИндексДерева)

	Колонки = Строка.Владелец().Колонки;
	Для Каждого Колонка из Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
 ИндексДерева = ИндексДерева +1;
КонецПроцедуры

Процедура ДобавитьКолонкиВТЗ(ТЗ,Строка, Индекс)

	Колонки = Строка.Владелец().Колонки;
	Для Каждого Колонка из Колонки Цикл
		ТЗ.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
    Индекс = Индекс +1;
КонецПроцедуры

Функция ПреобразоватьВремя(ВремяРаботы)
	Часы   = Цел( ВремяРаботы / 3600 );
	Минуты = Цел( ( ВремяРаботы - Часы * 3600 ) /60 );
	Сек    = ВремяРаботы -Часы * 3600 - Минуты * 60;
	ИтоговаяСтрока = Строка( Часы ) + "ч. " + Строка( Минуты ) + "мин." + Строка( Сек ) + "с.";
	Возврат ИтоговаяСтрока;
КонецФункции

#КонецОбласти

#КонецЕсли
